<template>
  <div class="articleSection">
    <h1 class="articleTitle">{{ article.title }}</h1>
    <div class="articleBrown">
      <q-breadcrumbs class="text-pink-8">
        <template v-slot:separator>
          <q-icon size="1.5em" name="chevron_right" color="pink-8" />
        </template>
        <q-breadcrumbs-el label="健康資訊" @click="goBack" class="pointer" />
        <q-breadcrumbs-el :label="article.title" />
      </q-breadcrumbs>
      <p class="articleTime">
        time:
        <span>{{ article.date }}</span>
      </p>
    </div>
    <q-card class="articleCard">
      <img :src="article.image" class="articleImg" alt="文章圖片" />
      <div v-for="(section, index) in article.sections" :key="index" class="articleCardContent">
        <p>{{ section.title }}</p>
        <p v-html="section.content"></p>
      </div>
      <div class="articleFrom">
        <p>本文出處 : {{ article.from }}</p>
      </div>
      <div class="backBtn"><q-btn @click="goBack">回上一頁</q-btn></div>
    </q-card>
  </div>
</template>

<script setup>
const route = useRoute()
const router = useRouter()
const goBack = () => {
  router.back()
}

const articles = [
  {
    id: '1',
    title: '健康喝水原則',
    date: '2023-10-01',
    image: '/news/article1.png',
    from: 'HEHO健康 你喝對了嗎？ 遵守4個喝水原則 健康又安心 https://heho.com.tw/archives/10109',
    sections: [
      {
        title: '原則 1：按身體需求去喝水，別喝過量的水',
        content:
          ' 澳洲蒙那許大學首席研究員法雷爾（Michael Farrell）主張「按身體的需求去喝水才是正確的，覺得口渴時再喝水，比按照規定時間去喝水更健康」，而研究證實，過度飲用水後大腦吞咽機制工作量增加了3倍，也會使身體處於水中毒或低納血症的危險中，當血液中的納含量變得異常低時，可能會引起嗜睡、噁心，甚至昏迷的症狀。'
      },
      {
        content:
          '在正常的新陳代謝下，每人每天至少要有1000毫升的尿液，才能排除當天所製造的身體廢棄物，只要是尿液顏色清澈、並且每天排尿6至7次，就代表喝水量足夠。醫界有個簡易的算法來推估每個人每天應該飲用的水量，就是體重（公斤）X33=一天所需飲用水的毫升數，大概是1500至2000毫升。'
      },
      {
        title: '原則 2：喝脫水飲料要喝同量的水，不可用飲料代替水',
        content:
          ' 湯汁、飲料、及茶飲等有味道的液體，都不能用來取代喝水。如果喝了含咖啡因、酒精、加糖的脫水飲料，例如咖啡、汽水等碳酸飲料與酒類，就要補充更多的飲水，而補水的原則是「喝一杯脫水飲料，要補回一杯半同等量的純水」。'
      },
      {
        content:
          ' 補充脫水飲料的水份，不可以代替原本就需要喝的當日水量。舉例來說，你一天需要2000 毫升的飲水，而你今天喝了一杯100 毫升的咖啡，那你今天就需要喝上2000 +（100 X 1.5 = 150）= 2150 毫升的水量。'
      },
      {
        title: '原則 3：患特殊疾病者喝水需控制適量',
        content: ' 心血管疾病患者如果醫師沒有要求限制喝水量，最好在睡前半小時喝150cc的水，早上起床時也要喝水，可稀釋血液濃稠度，降低中風及心肌梗塞的可能性。'
      },
      {
        content:
          ' 如出現下肢水腫或短促呼吸時就得減少水分的攝取；如有心肺積水時，甚至要將每日攝取水量控制在500ml以內。因此若有疾病狀況，最好請教醫師再決定是否增減喝水量。而腎功能不好或洗腎的病人，因為腎臟腎絲球過濾功能變差，可以處理的水量變少，攝取水的份量要更加小心。'
      },
      {
        title: '原則 4：喝好水、暖水，別喝久置的水與冰水',
        content:
          ' 我們每天飲水所用的自來水含微量「三鹵甲烷」，雖不至於造成嚴重危害，但若能運用簡單方法在飲用前先去除，就能保障健康。可以自來水煮沸時先將抽油煙機打開，再打開水壺的蓋子、轉小火再煮5至10分鐘，簡單動作就可減少水中的三鹵甲烷，讓你的飲用水變成「好水」。'
      }
    ]
  },
  {
    id: '2',
    title: '水對人體的重要',
    date: '2023-10-01',
    image: '/news/article2.png',
    from: 'HEHO健康 水有多重要 說給你知道！ https://heho.com.tw/archives/11502',
    sections: [
      {
        content:
          '水是人體最重要的組成成分，我們體內有60%是水，而大腦就含有75%以上的水量。<br>大腦正不正常，水是關鍵之一，研究證實人體的大腦功能和攝水量有關，尤其是認知和情緒功能。<br>當我們體內缺水時，不管是大人還是小孩，注意力、記憶力、反應速度及正向情緒通通都扣分。'
      },
      {
        content:
          '一天當中，我們至少需要7杯水。湯汁、飲料、及茶飲等有味道的液體，都不能取代喝水。<br>如果喝了就要補充更多的飲水，而補水的原則是「喝一杯脫水飲料，要補回一杯半同等量的純水」。'
      },
      {
        title: '氣泡水和一般水一樣嗎？是不是更健康？',
        content: ' 答案是否定的。氣泡水不但會讓你感覺更餓，甚至會讓你變胖！所以還是喝水最健康。'
      },
      {
        content:
          ' 大部分的人都認為喝熱水比冰水好！但我必須要語重心長的告訴你，熱水亂喝可是不行的哦！<br>國外曾有研究針對長期飲用65度C以上的熱水沖茶喝的民眾做實驗，發現他們罹患食道癌的風險是一般人的8倍，這是因為食道內壁的黏膜在超過65度C時，食道的黏膜就會被燙傷。所以經常喝熱茶、熱湯的人長期下來會讓口腔、食道黏膜產生細胞病變，於是就提高了食道癌的機率，而且溫度越高，罹患的機率就越高。<br>在服用藥物時搭配熱開水，也可能會讓藥效減半，症狀加重，所以還是配溫開水最好！'
      },
      {
        title: '你或許會疑惑，喝冰水是不是也很不健康？',
        content:
          ' 在國外研究文獻顯示在人體實驗中發現喝了3℃冰水後卻可以增加新陳代謝 4.5%，並可持續 60 分鐘，這個實驗證明喝冰水可以「暫時增加」新陳代謝，但是只是喝室溫的冷水，就不會有增加代謝的情形。順帶一提，這項研究理論大人小孩通用。'
      },
      {
        content:
          '對於一般健康成人和孩童，喝冰水是可以暫時增加新陳代謝的，對於減重有正面的幫助。但如果你本身有氣喘、心臟病、控制不佳的高血壓，或是中風等等的病史，喝冰水會有誘發疾病發作的可能，請你千萬不要想不開。<br>但還是要注意，在夏天的時候喝冰水，有可能會越喝越渴、越喝越熱。'
      },
      {
        title: '雖然喝水很健康，但也別過量！',
        content:
          '只要是尿液顏色清澈、並且每天排尿6到7次，就代表喝水量足夠。<br>攝取過多水份也會造成痙攣、昏睡，甚至是俗稱的水中毒，會造成大腦細胞膨脹，出現腦水腫的現象，嚴重可致死。這時候病患會感覺到暈眩的不適感，但急救時絕不可讓病患躺下，會加速腦水腫的程度，所以除了要記得補充鹽水外，還要讓病患保持坐姿。'
      }
    ]
  },
  {
    id: '3',
    title: '喝水的好處',
    date: '2023-10-01',
    image: '/news/article3.jpg',
    from: 'HEHO健康 水喝的夠腦袋靈活、膝蓋不痛！多喝水的 6 大好處 https://heho.com.tw/archives/62367',
    sections: [
      {
        content:
          '水可以說是生命的基礎，也是全身關節的潤滑劑，更是神經系統的緩衝劑。人體有70%是水組成的，人體如果喪失10％水分時即會感到不適，開始對身體組織造成損傷，而喪失20～25％時就會對生命帶來危險。因此每天喝到足夠的水分是很重要的，而且只要持續多喝水，它為身體帶來的好處及變化是可以看見的！'
      },
      { title: '多喝水的６大好處' },
      {
        title: '1. 大腦變靈活',
        content:
          '水是維持腦部正常功能運作的關鍵之一，它與大腦記憶力、情緒、視覺專注力是有相關的，因為血裡有高達90%是水，而血水承載氧氣進入大腦，只要一缺水，就會缺血，導致腦缺氧。而大腦佔了體內氧氣消耗的20%，有充足的氧氣才能讓腦袋運轉更快、更靈活。'
      },
      {
        title: '2. 血管更健康',
        content: ' 多喝水可以幫助降低血液的黏稠度，減少血栓、高血壓以及心血管疾病的發生率。'
      },
      {
        title: '3. 抗老顯年輕',
        content: ' 水可以活化細胞、加速身體代謝以及排毒。而且肌膚的彈性也要靠水分來支撐，所以每天喝足夠的水分，就能有助於修復皮膚更顯年輕。'
      },
      {
        title: '5. 提升抵抗力',
        content:
          '水是非常重要的存在，它參與了整個身體的循環，可以幫助人體的細胞與組織想維持正常的生理機能。它可以運送養分、氧氣到各個組織，也可將廢物經由肝臟、腎臟排出體外。當體內的廢物、毒素排出體外後，抵抗力自然就提升。'
      },
      {
        title: '6. 加速新陳代謝',
        content:
          '身體有足夠水分，就能加速體內的新陳代謝、幫助排毒減肥。有研究顯示，水分攝取不足時會導致脂肪堆積，相反的如果有攝取到充足的水分，就能有效減少脂肪堆積在體內。'
      },
      {
        content:
          '※小提醒：人體吸收水分是有上限的，所以需要分次飲水。平均來說，人體20分鐘大約能吸收200c.c.的水分，快速、大量的飲水其實是做白工。建議可以將水放在手邊容易取得的位置，想到的時候就喝個幾口。'
      }
    ]
  },
  {
    id: '4',
    title: '冬天也要補水',
    date: '2023-10-01',
    image: '/news/article4.jpg',
    from: '健康2.0 冬天沒流汗也要多喝水！營養師：小心水喝不夠會中風、關節退化，甚至記憶力衰退 https://health.tvbs.com.tw/medical/330607',
    sections: [
      {
        content:
          '天氣冷，許多民眾都會忘記補充水分，或自以為沒流汗就可以不用喝水，但要注意，這樣可是會影響身體健康！營養師林雨薇表示，水喝太少，除了宿便纏身，也會導致許多疾病發生，甚至引發中風、關節退化及記憶力衰退！'
      },
      {
        title: '不渴也要喝水',
        content:
          '林雨薇指出，許多民眾因為不口渴，而忽略補充水分，結果出現尿液特別黃、排便乾硬，講話甚至有口臭等，但其實這些現象都是「身體在告訴你缺水」。但是不渴為什麼要喝水？林雨薇說，人體50至70%是水組成，且人體是一台精密且複雜的儀器，口腔、消化道、血液及呼吸循環系統、新陳代謝相關組織器官等，通通需要通過水為媒介才能新陳代謝，就連肌膚也不例外。若忽略喝水，身體會接二連三發生大小症狀。'
      },
      {
        content:
          ' 短時間缺水，可能出現宿便、口臭、濃黃尿。中期則有可能發生肌膚乾燥、皺紋、心悸、中風及尿道炎等。而長期缺水，則可能導致關節退化、記憶力衰退甚至發生尿毒症！'
      },
      {
        content:
          ' 林雨薇提醒，許多民眾忙起來，專注力都投入在工作、家庭、生活上，稍不留意，水分就有可能攝取不足，建議養成隨時隨地補充水分習慣，且定期如廁不憋尿的健康生活。'
      },
      {
        title: '每天應補充1500至2000cc白開水',
        content:
          '至於每天要喝多少水才夠？林雨薇說，每天應喝1500至2000cc白開水，以每杯250cc的水為例，即約6至8杯水。若有運動或大量流汗勞力活動時，也應再額外補充水分，有些民眾應身體狀況，不確定自己是否適合喝這麼多水，也可諮詢醫師及營養師。'
      },
      {
        content:
          '有些民眾也會擔心水喝太多會水腫，林雨薇說，水腫原因複雜，但容易引起水腫的外在3大因素為「吃太鹹、站太久、穿太緊」。也因此，飲食重口味、腳循環差或血管靜脈曲張、愛穿緊身褲者，要多加留意。另外若罹患心衰竭、腎衰竭、肝衰竭，或是身體營養不良也容易有腫水現象。林說，對於一般健康民眾而言，日常保健飲水不會直接引起病理性水腫，而外在因素引起的水腫情況，通常較為短暫非長期慢性。'
      },
      {
        content:
          '※小提醒：人體吸收水分是有上限的，所以需要分次飲水。平均來說，人體20分鐘大約能吸收200c.c.的水分，快速、大量的飲水其實是做白工。建議可以將水放在手邊容易取得的位置，想到的時候就喝個幾口。'
      }
    ]
  },
  {
    id: '5',
    title: '喝水不只可以保健，還能減肥?',
    date: '2023-10-01',
    image: '/news/article5.jpg',
    from: 'HEHO健康喝水也能瘦！運動營養師小紅教你減肥的喝水公式！https://heho.com.tw/archives/51821',
    sections: [
      {
        content:
          '水份攝取量，會依每個人的年齡、體型、性別、體重、工作性質而不同，運動營養師小紅（蘇政瑜）表示，一般人每天的基本喝水建議量，是將自己的體重乘以30（單位：c.c.），就是每天建議的喝水量。舉例來說，一個體重60公斤的人，每天的建議飲水量就是60 × 30 = 1800c.c.。'
      },
      {
        content: '不過，如果是想要用喝水減肥的人，就需要將自己的體重乘以40，作為每天的基本喝水量。像是60公斤的人，就需要喝到2400c.c.的水。'
      },
      {
        title: '一次猛灌500c.c.水 反而是做白工',
        content:
          '人體吸收水分是有上限的，所以需要分次飲水。「平均來說，人體20分鐘大約能吸收200c.c.的水分，攝取水分的速度不要快於這個。有的人為了達到飲水目標，一次猛灌500c.c.，但是去一下廁所就沒了，」 蘇政瑜指出，快速、大量的飲水其實是做白工。建議可以將水放在手邊容易取得的位置，想到的時候就喝個幾口。'
      },
      {
        content:
          ' 至於喝水的時機，蘇政瑜表示，只要不要睡前飲水、影響睡眠就好。目前的營養學教科書上，並沒有特別強調水溫，雖然過去有研究認為喝冰水時身體會消耗更多卡路里，不過其實差別微乎其微，加上中醫不提倡喝冰水，因此蘇政瑜認為，選擇自己喜歡的即可。'
      },
      {
        title: '如果不喜歡白開水 你還有這些選擇',
        content:
          '另外，我們每天吃的食物內就含有很多水分，如飯菜、麵湯、稀飯、蔬果、果汁等等，都內含的水份，都算是喝水。「所以，如果不喜歡喝水，也可以換成無糖、零熱量的飲料，例如黑咖啡、茶或是檸檬汁，」蘇政瑜指出。'
      },
      {
        content:
          '對於有運動習慣的人，蘇政瑜建議，至少要在30分鐘前先飲水，如果運動會在一個小時內結束，也不需要在運動間特別補充水分。如果運動期間想喝水，就喝1、2口就好了。'
      },
      {
        title: '水喝多了會不會有壞處？',
        content:
          '有些人擔心，水喝太多會不會造成水中毒？林新醫院腎臟內科主任黃嘉宏表示，在正常的身體狀況下，所謂的水中毒（即低滲透壓性低血鈉），得每日飲水到10公升以上，請民眾不必過於擔心。'
      },
      {
        content:
          '不過，腎功能不好或洗腎的病人，因為腎臟腎絲球過濾功能變差，可以處理的水量變少，攝取水份量就要特別加小心。慢性腎臟病有各種不同的原因及嚴重程度，病人應該和腎臟專科醫師討論自己適當的水份及電解質攝取量，以達到適當的體力、血壓、心律、呼吸及沒有水腫為最理想。'
      }
    ]
  },
  {
    id: '6',
    title: '喝水治百病！？補充水分好健康！',
    date: '2023-10-01',
    image: '/news/article6.jpg',
    from: 'HEHO健康 喝水治百病！補充水分好健康！https://heho.com.tw/archives/72365',
    sections: [
      {
        content:
          '常聽人說喝水好健康，喝水到底是對哪裡健康呢？人體有70%是水組成的，身體各個器官與系統都仰賴水分的補給才能維持基礎運作。喝水真的好處多多，這裡列出18個需要你時時補充水分的部位，提醒大家多多喝水。'
      },
      {
        title: '喝水百病消',
        content:
          '1. 大腦<br>補充水分有益於大腦複雜的認知工作與記憶力，並有益於學習能力，改善情緒問題<br><br>2. 腦脊髓液<br>腦脊髓液幾乎都由水分組成，可保護腦部不受外力影響，減輕大腦壓力<br><br>3. 眼睛<br>眼睛結構幾乎由水組成，水分具運送營養及維持眼內壓力的作用<br><br>4. 嘴巴<br>嘴乾也是口臭原因之一，唾液具殺菌作用，能殺死病菌減少口腔異味，而多喝水能刺激唾液分泌<br><br>5. 呼吸道<br>保持呼吸道濕潤能形成屏障，避免外界刺激物干擾，減少過敏、和緩氣喘症狀<br><br>6. 心臟<br>缺水時心跳會跳得比平常快，使人心悸不舒服<br><br>7. 肝臟<br>肝臟需水份才能分解肝醣、儲存能量，無法分解肝醣會影響血糖恆定<br><br>8. 腸胃<br>水份不足會使消化不良或是便秘，可喝點水幫助腸胃蠕動<br><br>9. 脾臟<br>脾臟缺水時會使身體代謝能力下降，長期缺水有可能使脾腫大<br><br>10. 腎臟<br>腎臟若缺水會影響毒素代謝、生成結石、增加泌尿道感染的機率<br><br>11. 脊椎<br>若椎間盤軟骨水份不足，容易彎腰駝背、腰酸背痛<br><br>12. 女性私密處<br>陰道屬於黏膜組織，需水分滋潤，充足水分可減少異味<br><br>13. 皮膚<br>皮膚缺水角質層就會受損，無法發揮對外的屏障能力，產生黯淡、乾燥、敏感、脫皮、粗糙等狀況<br><br>14. 血液<br>血液負責運輸、物質交換，缺水會影響循環，使人疲累。水分不足還會使血液變濃稠，血壓升高<br><br>15. 肌肉<br>水分充足能使肌肉維持電解質平衡，比較不會疲勞<br><br>16. 淋巴結<br>缺水會影響淋巴結過濾和清除掉病原體、排除毒素的能力<br><br>17. 軟骨組織<br>軟骨中的水分能夠減少關節摩擦，並吸收震動。缺水容易磨損軟骨<br><br>18. 新陳代謝<br>缺水會使代謝功能下降，進而影響減重<br><br>'
      }
    ]
  }
]

const article = ref({})

article.value = articles.find(a => a.id === route.params.id)
</script>

<style lang="scss" scoped>
@import 'assets/newsContent';
</style>
